{
  "backend/main.mo": "Main actor for a user account system implementing registration, authentication, profile management, and role-based access control using a username/password model with case-insensitive username normalization.",
  "backend/migration.mo": "Migration module that upgrades actor state by building a `usernameMap` index from existing `userAccounts` data, mapping normalized usernames to their corresponding principals.",
  "feature_evidence.json": "Feature evidence report documenting that the signup page frontend was updated to normalize usernames (trim + lowercase) before backend submission, with references to the affected files and test ID REQ-10.",
  "frontend-file-summaries.txt": "JSON document containing short summaries of each frontend source file, describing their roles in styling, routing, authentication, and UI pages.",
  "frontend/index.css": "Tailwind CSS base file defining OKLCH-based CSS custom properties for light and dark themes, covering background, foreground, primary, and chart color tokens.",
  "frontend/index.html": "Minimal HTML entry point for the React app, mounting the app into a `#root` div and loading the main TypeScript module.",
  "frontend/src/App.tsx": "Sets up TanStack Router with routes for login, signup, home, and user detail pages, including `beforeLoad` guards that redirect based on localStorage session presence.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and caches an ICP backend actor, using an anonymous or authenticated identity and initializing access control with an optional admin token.",
  "frontend/src/hooks/useAuth.ts": "Custom hook managing a username-based auth session persisted in localStorage, exposing `saveSession` and `clearSession` helpers.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity context and provider using `@dfinity/auth-client`, exposing login/clear functions and status flags for ICP identity management.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for backend interactions; `useRegisterUser` and `useAuthenticateUser` normalize usernames via `trim().toLowerCase()` before calling the backend, and `useSearchUsers` lowercases the search prefix.",
  "frontend/src/index.css": "Global CSS file that imports Inter font, sets up Tailwind directives, and defines dark-first CSS custom properties for theming (colors, sidebar, charts) plus a thin scrollbar utility.",
  "frontend/src/main.tsx": "React app entry point that wraps the App component with QueryClientProvider and InternetIdentityProvider before mounting to the DOM.",
  "frontend/src/pages/HomePage.tsx": "Home page component featuring a debounced user search input, search results list, and a header showing the logged-in user's avatar with a logout button.",
  "frontend/src/pages/LoginPage.tsx": "Login page with a username/password form that authenticates via a mutation hook, saves the session, and navigates to home on success.",
  "frontend/src/pages/SignupPage.tsx": "Signup page with username/password/confirm-password fields, inline validation, password strength indicators, and auto-login after successful registration.",
  "frontend/src/pages/UserDetailPage.tsx": "User profile detail page that displays avatar, display name, and profile info rows, with skeleton loading state for the caller's own profile fetched via a query hook.",
  "frontend/src/utils/urlParams.ts": "Utility module providing functions to read, store, persist, and clear URL parameters from both query strings and hash-based routing, with sessionStorage fallback.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with dark mode, custom OKLCH color tokens, extended border radii, box shadows, and keyframe animations for the frontend app.",
  "project_state.json": "Tracks project state version 7 for a WhatsApp-like messaging app, listing existing features, known issues (signup false 'username taken' error), and architectural notes."
}