{
  "kind": "build_request",
  "title": "Fix false 'username already taken' error on signup",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-9",
      "text": "Fix the backend register function so that username uniqueness checks are performed in a case-insensitive manner. Normalize both the stored usernames and the incoming username to lowercase (or a consistent canonical form) before comparison, so that a genuinely unique username is never incorrectly rejected with a 'username already taken' error.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-recent"
        ],
        "quotes": [
          "In signup i am filling a unique name that not taken anyone but still username is already taken problem arisen"
        ]
      },
      "acceptanceCriteria": [
        "Registering a brand-new username that has never been used returns a success response, not a 'username already taken' error.",
        "Username uniqueness comparison is case-insensitive — e.g., 'Alice' and 'alice' are treated as the same username.",
        "Attempting to register a username that genuinely already exists (same canonical form) still correctly returns a 'username already taken' error.",
        "Existing registered users are unaffected and can still log in after the fix."
      ]
    },
    {
      "id": "REQ-10",
      "text": "Update the signup page frontend to ensure that the username value sent to the backend register function is normalized to lowercase (trimmed of leading/trailing whitespace and lowercased) before submission, so the stored username is always in a consistent canonical form.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent"
        ],
        "quotes": [
          "In signup i am filling a unique name that not taken anyone but still username is already taken problem arisen"
        ]
      },
      "acceptanceCriteria": [
        "The username submitted to the backend during signup is trimmed and lowercased.",
        "The signup form still validates that the username is non-empty after trimming.",
        "Error messages for truly taken usernames remain visible; no false-positive 'username already taken' errors appear for unique usernames."
      ]
    }
  ],
  "constraints": [
    "Do not change the existing user data schema or break backward compatibility for already-registered users.",
    "Do not modify any files listed in frontend.immutablePaths."
  ],
  "nonGoals": [
    "Adding new profile fields or changing the registration flow beyond the username normalization fix.",
    "Changing password hashing or authentication logic.",
    "UI redesign of the signup page beyond fixing the error handling."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}